clc,clear;
W=rand(4,4);    % W是忆阻器的值，与电阻负相关
V=[2.2 2.2 2.2 2.2];    
% 在忆阻器阵列中，电压应该是保持某种特定输出进行的,比如2.2V
% 实际上，可能是正弦型的电压，忆阻器的电阻与电流(电荷)的方向有关
VV=[V;V;V;V];
% VV=ones(4,4);
ii=W.*VV;       % 在这一步忆阻器进行阻值的变化，需要在这一步进行正反馈。
%% 值是一样的，说明模拟忆阻器阵列是正确的
i=sum(ii,2);
% 3.36175671629583
% 2.45359652599715
% 1.36337858572690
% 2.57273649573183
I=W*V';
% 3.36175671629583
% 2.45359652599715
% 1.36337858572690
% 2.57273649573183
%% 模拟正反馈，只需要一个W关于i的正相关函数，比如(i/(1+i))，后期考虑收敛等问题
W_page=zeros(4,4,15);
ii_page=zeros(4,4,15);  % 考虑收敛的问题，主要是考虑电流的收敛问题
for k=1:10
    W_page(:,:,k)=W;
    ii_page(:,:,k)=ii;
    W=ii./(1+ii).*W;
    ii=W.*VV;
end



